<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b819d733c9732a9332169c1c5b3a1670192777ee5d662aadddda81d3601e41ad","plan_job_ref":"Job OpenTofu AWS RDS Deployment #16 at https://github.com/cheetah1989/opentofu-rds/actions/runs/21119084040","plan_out_hash":"689bbf7d75ca135863141562ae30584850c5075d5f94564e6da3e0d078266f68","plan_hash":"a8c0bb45c7f4fde2b859a143c93a3d7f70bde6ad91291c12cf8fd6aa13efbda8","plan_text_format":"diff","version":"2.2.3"} -->
OpenTofu plan in __opentofu_rds_iac__
<details>
<summary>Plan: 5 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy

OpenTofu will perform the following actions:

  # aws_db_instance.opentofuRDS will be created
+   resource "aws_db_instance" "opentofuRDS" {
+       address                               = (known after apply)
+       allocated_storage                     = 10
+       apply_immediately                     = false
+       arn                                   = (known after apply)
+       auto_minor_version_upgrade            = true
+       availability_zone                     = (known after apply)
+       backup_retention_period               = (known after apply)
+       backup_target                         = (known after apply)
+       backup_window                         = (known after apply)
+       ca_cert_identifier                    = (known after apply)
+       character_set_name                    = (known after apply)
+       copy_tags_to_snapshot                 = false
+       database_insights_mode                = (known after apply)
+       db_name                               = "opentofurdsdb"
+       db_subnet_group_name                  = "opentofu_rds_db_subnet_group"
+       dedicated_log_volume                  = false
+       delete_automated_backups              = true
+       deletion_protection                   = false
+       domain_fqdn                           = (known after apply)
+       endpoint                              = (known after apply)
+       engine                                = "mysql"
+       engine_lifecycle_support              = (known after apply)
+       engine_version                        = "8.0"
+       engine_version_actual                 = (known after apply)
+       hosted_zone_id                        = (known after apply)
+       id                                    = (known after apply)
+       identifier                            = (known after apply)
+       identifier_prefix                     = (known after apply)
+       instance_class                        = "db.t3.micro"
+       iops                                  = (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
+       license_model                         = (known after apply)
+       listener_endpoint                     = (known after apply)
+       maintenance_window                    = (known after apply)
+       master_user_secret                    = (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
+       monitoring_interval                   = 0
+       monitoring_role_arn                   = (known after apply)
+       multi_az                              = (known after apply)
+       nchar_character_set_name              = (known after apply)
+       network_type                          = (known after apply)
+       option_group_name                     = (known after apply)
+       parameter_group_name                  = "default.mysql8.0"
+       password                              = (sensitive value)
+       password_wo                           = (write-only attribute)
+       performance_insights_enabled          = false
+       performance_insights_kms_key_id       = (known after apply)
+       performance_insights_retention_period = (known after apply)
+       port                                  = (known after apply)
+       publicly_accessible                   = false
+       region                                = "ap-south-1"
+       replica_mode                          = (known after apply)
+       replicas                              = (known after apply)
+       resource_id                           = (known after apply)
+       skip_final_snapshot                   = true
+       snapshot_identifier                   = (known after apply)
+       status                                = (known after apply)
+       storage_throughput                    = (known after apply)
+       storage_type                          = (known after apply)
+       tags_all                              = {
+           "Environment" = "Practice-Sandbox"
+           "Owner"       = "Chetan Pardeshi"
        }
+       timezone                              = (known after apply)
+       upgrade_rollout_order                 = (known after apply)
+       username                              = "mysqladmin"
+       vpc_security_group_ids                = [
+           "sg-0f2474d9138c5a4ce",
        ]
    }

  # aws_db_subnet_group.opentofuRDS_db_subnet_group will be created
+   resource "aws_db_subnet_group" "opentofuRDS_db_subnet_group" {
+       arn                     = (known after apply)
+       description             = "Managed by Terraform"
+       id                      = (known after apply)
+       name                    = "opentofu_rds_db_subnet_group"
+       name_prefix             = (known after apply)
+       region                  = "ap-south-1"
+       subnet_ids              = (known after apply)
+       supported_network_types = (known after apply)
+       tags                    = {
+           "Purpose" = "Subnet group for RDS instance"
        }
+       tags_all                = {
+           "Environment" = "Practice-Sandbox"
+           "Owner"       = "Chetan Pardeshi"
+           "Purpose"     = "Subnet group for RDS instance"
        }
+       vpc_id                  = (known after apply)
    }

  # aws_instance.opentofu_bastion will be created
+   resource "aws_instance" "opentofu_bastion" {
+       ami                                  = "ami-0c55b159cbfafe1f0"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       enable_primary_ipv6                  = (known after apply)
+       force_destroy                        = false
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       host_resource_group_arn              = (known after apply)
+       iam_instance_profile                 = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_lifecycle                   = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "opentofu_keypair"
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_group_id                   = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       region                               = "ap-south-1"
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       spot_instance_request_id             = (known after apply)
+       subnet_id                            = "************************"
+       tags                                 = {
+           "Name"    = "opentofu_bastion"
+           "Purpose" = "Bastion Host for RDS Access"
        }
+       tags_all                             = {
+           "Environment" = "Practice-Sandbox"
+           "Name"        = "opentofu_bastion"
+           "Owner"       = "Chetan Pardeshi"
+           "Purpose"     = "Bastion Host for RDS Access"
        }
+       tenancy                              = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = [
+           "sg-0da0ac8702928ab0d",
        ]

+       capacity_reservation_specification (known after apply)

+       cpu_options (known after apply)

+       ebs_block_device (known after apply)

+       enclave_options (known after apply)

+       ephemeral_block_device (known after apply)

+       instance_market_options (known after apply)

+       maintenance_options (known after apply)

+       metadata_options (known after apply)

+       network_interface (known after apply)

+       primary_network_interface (known after apply)

+       private_dns_name_options (known after apply)

+       root_block_device (known after apply)
    }

  # aws_subnet.opentofuRDS_privsubnet will be destroyed
  # (because aws_subnet.opentofuRDS_privsubnet is not in configuration)
-   resource "aws_subnet" "opentofuRDS_privsubnet" {
-       arn                                            = "arn:aws:ec2:ap-south-1:207752776952:subnet/subnet-0ef49705fa10d0c65" -> null
-       assign_ipv6_address_on_creation                = false -> null
-       availability_zone                              = "ap-south-1a" -> null
-       availability_zone_id                           = "aps1-az1" -> null
-       cidr_block                                     = "10.0.2.0/24" -> null
-       enable_dns64                                   = false -> null
-       enable_lni_at_device_index                     = 0 -> null
-       enable_resource_name_dns_a_record_on_launch    = false -> null
-       enable_resource_name_dns_aaaa_record_on_launch = false -> null
-       id                                             = "subnet-0ef49705fa10d0c65" -> null
-       ipv6_native                                    = false -> null
-       map_customer_owned_ip_on_launch                = false -> null
-       map_public_ip_on_launch                        = false -> null
-       owner_id                                       = "207752776952" -> null
-       private_dns_hostname_type_on_launch            = "ip-name" -> null
-       region                                         = "ap-south-1" -> null
-       tags                                           = {
-           "Purpose" = "opentofuRDS_private_subnet"
        } -> null
-       tags_all                                       = {
-           "Environment" = "Practice-Sandbox"
-           "Owner"       = "Chetan Pardeshi"
-           "Purpose"     = "opentofuRDS_private_subnet"
        } -> null
-       vpc_id                                         = "vpc-0dcfa60e318da340e" -> null
    }

  # aws_subnet.opentofuRDS_privsubnet1 will be created
+   resource "aws_subnet" "opentofuRDS_privsubnet1" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = (known after apply)
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "ap-south-1"
+       tags                                           = {
+           "Purpose" = "opentofuRDS_private_subnet"
        }
+       tags_all                                       = {
+           "Environment" = "Practice-Sandbox"
+           "Owner"       = "Chetan Pardeshi"
+           "Purpose"     = "opentofuRDS_private_subnet"
        }
+       vpc_id                                         = "*********************"
    }

  # aws_subnet.opentofuRDS_privsubnet2 will be created
+   resource "aws_subnet" "opentofuRDS_privsubnet2" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = (known after apply)
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.3.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       region                                         = "ap-south-1"
+       tags                                           = {
+           "Purpose" = "opentofuRDS_private_subnet"
        }
+       tags_all                                       = {
+           "Environment" = "Practice-Sandbox"
+           "Owner"       = "Chetan Pardeshi"
+           "Purpose"     = "opentofuRDS_private_subnet"
        }
+       vpc_id                                         = "*********************"
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Changes to Outputs:
+   ec2_bastion_public_ip = (known after apply)
+   rds_endpoint          = (known after apply)
```
</details>

:memo: Plan generated in [OpenTofu AWS RDS Deployment #16](https://github.com/cheetah1989/opentofu-rds/actions/runs/21119084040)